laravel_octane_test/ab_test.log
# php artisan octane:start
$ ab -n 1000 -c 8 http://127.0.0.1:8000/              
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/      

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        OpenSwoole
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /
Document Length:        17605 bytes

Concurrency Level:      8
Time taken for tests:   3.647 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      18718000 bytes
HTML transferred:       17605000 bytes
Requests per second:    274.18 [#/sec] (mean)
Time per request:       29.178 [ms] (mean)
Time per request:       3.647 [ms] (mean, across all concurrent requests)
Transfer rate:          5011.81 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   6.0      0     117
Processing:     7   25  33.3     17     308
Waiting:        7   22  32.5     14     308
Total:          7   26  33.9     18     308

Percentage of the requests served within a certain time (ms)
  50%     18
  66%     22
  75%     25
  80%     27
  90%     35
  95%     72
  98%    160
  99%    213
 100%    308 (longest request)



# php artisan serve
$ab -n 1000 -c 8 http://127.0.0.1:8000/
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/      

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:
Server Hostname:        127.0.0.1  
Server Port:            8000       

Document Path:          /
Document Length:        17592 bytes

Concurrency Level:      8
Time taken for tests:   19.188 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      18763000 bytes
HTML transferred:       17592000 bytes
Requests per second:    52.11 [#/sec] (mean)
Time per request:       153.508 [ms] (mean)
Time per request:       19.188 [ms] (mean, across all concurrent requests)
Transfer rate:          954.91 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   3.9      0      79
Processing:    15  146  57.2    122     431
Waiting:       14  146  57.0    122     431
Total:         16  147  57.4    123     432

Percentage of the requests served within a certain time (ms)
  50%    123
  66%    133
  75%    164
  80%    188
  90%    226
  95%    269
  98%    304
  99%    366
 100%    432 (longest request)